Tekla Open API Reference for Tekla Structures 2025
SurfaceTreatment.Color Property
 The color of the surfacing.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SurfaceTreatment.SurfaceColorEnum Color { get; set; }
Public Property Color As SurfaceTreatment.SurfaceColorEnum
	Get
	Set
Property Value
Type: SurfaceTreatment.SurfaceColorEnum
See Also
Reference
SurfaceTreatment Class
Tekla.Structures.Model Namespace